results/ycsb/4-nodes/6-clients/couchbase2/workloadc_couchbase_custom-validation/results-40.txt
[OVERALL], RunTime(ms), 162931
[OVERALL], Throughput(ops/sec), 613.7567436522208
[TOTAL_GCS_G1_Young_Generation], Count, 47
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1054
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6468996078094408
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 47
[TOTAL_GC_TIME], Time(ms), 1054
[TOTAL_GC_TIME_%], Time(%), 0.6468996078094408
[CLEANUP], Operations, 40
[CLEANUP], AverageLatency(us), 0.875
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 11
[CLEANUP], 0, 1.0
[CLEANUP], 1000, 0.5
[CLEANUP], 2000, 0.7142857142857143
[CLEANUP], 3000, 0.4444444444444444
[CLEANUP], 4000, 2.2857142857142856
[UPDATE], Operations, 5068
[UPDATE], AverageLatency(us), 9613.843330702446
[UPDATE], MinLatency(us), 213
[UPDATE], MaxLatency(us), 2984753
[UPDATE], Return=OK, 5068
[UPDATE], 0, 711654.0
[UPDATE], 1000, 38007.16
[UPDATE], 2000, 17281.238095238095
[UPDATE], 3000, 11809.652173913044
[UPDATE], 4000, 15465.619047619048
[UPDATE], 5000, 15124.379310344828
[UPDATE], 6000, 10846.9
[UPDATE], 7000, 7866.0
[UPDATE], 8000, 7119.588235294118
[UPDATE], 9000, 11019.0
[UPDATE], 10000, 13298.527777777777
[UPDATE], 11000, 7281.424242424242
[UPDATE], 12000, 8006.12
[UPDATE], 13000, 8470.692307692309
[UPDATE], 14000, 6290.958333333333
[UPDATE], 15000, 11808.233333333334
[UPDATE], 16000, 11079.413793103447
[UPDATE], 17000, 14275.16
[UPDATE], 18000, 16953.483870967742
[UPDATE], 19000, 9954.333333333334
[UPDATE], 20000, 9394.263157894737
[UPDATE], 21000, 7864.214285714285
[UPDATE], 22000, 8365.733333333334
[UPDATE], 23000, 7927.622222222222
[UPDATE], 24000, 7196.310344827586
[UPDATE], 25000, 10431.088235294117
[UPDATE], 26000, 7540.275862068966
[UPDATE], 27000, 69023.30769230769
[UPDATE], 28000, 7313.086956521739
[UPDATE], 29000, 7523.5161290322585
[UPDATE], 30000, 7253.638888888889
[UPDATE], 31000, 5577.434782608696
[UPDATE], 32000, 9794.130434782608
[UPDATE], 33000, 6051.15
[UPDATE], 34000, 6553.735294117647
[UPDATE], 35000, 7193.958333333333
[UPDATE], 36000, 12399.78125
[UPDATE], 37000, 6028.375
[UPDATE], 38000, 10625.90243902439
[UPDATE], 39000, 6967.74358974359
[UPDATE], 40000, 9416.157894736842
[UPDATE], 41000, 7753.807692307692
[UPDATE], 42000, 6480.75
[UPDATE], 43000, 4774.5
[UPDATE], 44000, 9113.060606060606
[UPDATE], 45000, 9531.703703703704
[UPDATE], 46000, 7594.821428571428
[UPDATE], 47000, 4657.071428571428
[UPDATE], 48000, 6075.166666666667
[UPDATE], 49000, 6526.882352941177
[UPDATE], 50000, 5146.625
[UPDATE], 51000, 8470.5
[UPDATE], 52000, 5813.37037037037
[UPDATE], 53000, 5722.257142857143
[UPDATE], 54000, 12931.166666666666
[UPDATE], 55000, 7393.632653061224
[UPDATE], 56000, 11046.30303030303
[UPDATE], 57000, 7810.170731707317
[UPDATE], 58000, 6937.409090909091
[UPDATE], 59000, 7859.431372549019
[UPDATE], 60000, 7396.615384615385
[UPDATE], 61000, 6042.27027027027
[UPDATE], 62000, 8887.48
[UPDATE], 63000, 7568.3
[UPDATE], 64000, 9175.30303030303
[UPDATE], 65000, 8321.057142857142
[UPDATE], 66000, 8213.615384615385
[UPDATE], 67000, 8353.36
[UPDATE], 68000, 6883.384615384615
[UPDATE], 69000, 4912.5161290322585
[UPDATE], 70000, 7088.62962962963
[UPDATE], 71000, 4776.25
[UPDATE], 72000, 18827.235294117647
[UPDATE], 73000, 6010.645161290323
[UPDATE], 74000, 8046.565217391304
[UPDATE], 75000, 6478.333333333333
[UPDATE], 76000, 6586.125
[UPDATE], 77000, 4358.0
[UPDATE], 78000, 7947.76
[UPDATE], 79000, 6967.5675675675675
[UPDATE], 80000, 7552.103448275862
[UPDATE], 81000, 6585.333333333333
[UPDATE], 82000, 8180.913043478261
[UPDATE], 83000, 5101.315789473684
[UPDATE], 84000, 5148.5625
[UPDATE], 85000, 5762.586956521739
[UPDATE], 86000, 6577.590909090909
[UPDATE], 87000, 4767.558139534884
[UPDATE], 88000, 6899.3488372093025
[UPDATE], 89000, 9603.52
[UPDATE], 90000, 5450.4047619047615
[UPDATE], 91000, 4642.291666666667
[UPDATE], 92000, 8110.928571428572
[UPDATE], 93000, 5643.0526315789475
[UPDATE], 94000, 14203.29411764706
[UPDATE], 95000, 7175.666666666667
[UPDATE], 96000, 6752.3
[UPDATE], 97000, 6894.681818181818
[UPDATE], 98000, 7758.7037037037035
[UPDATE], 99000, 4317.228571428572
[UPDATE], 100000, 6759.304347826087
[UPDATE], 101000, 6481.358974358975
[UPDATE], 102000, 5664.266666666666
[UPDATE], 103000, 3226.4583333333335
[UPDATE], 104000, 9527.380952380952
[UPDATE], 105000, 4813.666666666667
[UPDATE], 106000, 4364.529411764706
[UPDATE], 107000, 6608.2
[UPDATE], 108000, 5115.9473684210525
[UPDATE], 109000, 5416.878787878788
[UPDATE], 110000, 5327.195121951219
[UPDATE], 111000, 3945.8048780487807
[UPDATE], 112000, 8868.470588235294
[UPDATE], 113000, 5094.760869565217
[UPDATE], 114000, 6184.268292682927
[UPDATE], 115000, 6452.659090909091
[UPDATE], 116000, 5447.7555555555555
[UPDATE], 117000, 4569.318181818182
[UPDATE], 118000, 7246.25641025641
[UPDATE], 119000, 6091.541666666667
[UPDATE], 120000, 4537.241379310345
[UPDATE], 121000, 7875.454545454545
[UPDATE], 122000, 5498.517241379311
[UPDATE], 123000, 4112.589743589743
[UPDATE], 124000, 4169.3
[UPDATE], 125000, 4211.25
[UPDATE], 126000, 8953.608695652174
[UPDATE], 127000, 3412.25
[UPDATE], 128000, 7307.6578947368425
[UPDATE], 129000, 4783.027027027027
[UPDATE], 130000, 6908.478260869565
[UPDATE], 131000, 9874.57142857143
[UPDATE], 132000, 4732.666666666667
[UPDATE], 133000, 6222.758620689655
[UPDATE], 134000, 5420.51282051282
[UPDATE], 135000, 3264.8695652173915
[UPDATE], 136000, 6225.0
[UPDATE], 137000, 5020.787878787879
[UPDATE], 138000, 8317.548387096775
[UPDATE], 139000, 8117.625
[UPDATE], 140000, 5010.448275862069
[UPDATE], 141000, 4360.361111111111
[UPDATE], 142000, 5477.0
[UPDATE], 143000, 5123.2
[UPDATE], 144000, 5471.783783783784
[UPDATE], 145000, 7397.375
[UPDATE], 146000, 5763.763157894737
[UPDATE], 147000, 6955.321428571428
[UPDATE], 148000, 5893.166666666667
[UPDATE], 149000, 10059.0
[UPDATE], 150000, 5458.76
[UPDATE], 151000, 9563.875
[UPDATE], 152000, 10509.60606060606
[UPDATE], 153000, 12153.888888888889
[UPDATE], 154000, 4181.935483870968
[UPDATE], 155000, 6219.416666666667
[UPDATE], 156000, 5766.172413793103
[UPDATE], 157000, 3945.3076923076924
[SCAN], Operations, 94932
[SCAN], AverageLatency(us), 66433.42847511903
[SCAN], MinLatency(us), 1295
[SCAN], MaxLatency(us), 3323449
[SCAN], Return=OK, 94932
[SCAN], 0, 942181.7603305785
[SCAN], 1000, 89977.81797752809
[SCAN], 2000, 95617.81167108753
[SCAN], 3000, 116144.4410958904
[SCAN], 4000, 83585.5611814346
[SCAN], 5000, 80057.92213114754
[SCAN], 6000, 81356.51089108911
[SCAN], 7000, 59205.95141065831
[SCAN], 8000, 67248.21797004991
[SCAN], 9000, 70227.40102389078
[SCAN], 10000, 70081.14260249554
[SCAN], 11000, 71587.67158671586
[SCAN], 12000, 74590.33149171271
[SCAN], 13000, 71938.16165413534
[SCAN], 14000, 86049.48931623931
[SCAN], 15000, 82110.8004032258
[SCAN], 16000, 72654.70297029703
[SCAN], 17000, 76444.10946196661
[SCAN], 18000, 71338.66371681416
[SCAN], 19000, 65971.71322160149
[SCAN], 20000, 80238.89048473968
[SCAN], 21000, 55751.83798882682
[SCAN], 22000, 59525.3626707132
[SCAN], 23000, 51015.68837803321
[SCAN], 24000, 65152.07272727273
[SCAN], 25000, 57194.25141242938
[SCAN], 26000, 52367.85575589459
[SCAN], 27000, 69741.08525754884
[SCAN], 28000, 85868.29157667387
[SCAN], 29000, 65161.802250803856
[SCAN], 30000, 65001.32338308458
[SCAN], 31000, 69631.61938958707
[SCAN], 32000, 73377.16123188406
[SCAN], 33000, 69173.83391608391
[SCAN], 34000, 68146.32534246576
[SCAN], 35000, 70162.91652173913
[SCAN], 36000, 63670.04684975767
[SCAN], 37000, 54324.19672131148
[SCAN], 38000, 57273.84693877551
[SCAN], 39000, 55805.96570644719
[SCAN], 40000, 63722.64781906301
[SCAN], 41000, 64981.5855704698
[SCAN], 42000, 61981.550580431176
[SCAN], 43000, 81403.32251908397
[SCAN], 44000, 66873.48625429554
[SCAN], 45000, 63334.416927899685
[SCAN], 46000, 71060.50179856115
[SCAN], 47000, 62680.234042553195
[SCAN], 48000, 75991.13768115942
[SCAN], 49000, 68223.80067567568
[SCAN], 50000, 50809.57181208054
[SCAN], 51000, 76570.94676806084
[SCAN], 52000, 70511.83272727273
[SCAN], 53000, 87680.96041666667
[SCAN], 54000, 56113.45815602837
[SCAN], 55000, 46241.42136854742
[SCAN], 56000, 54889.29322268326
[SCAN], 57000, 53180.59066666666
[SCAN], 58000, 94205.75550122249
[SCAN], 59000, 70303.8887015177
[SCAN], 60000, 63087.59649122807
[SCAN], 61000, 70259.77208480565
[SCAN], 62000, 67059.04280821918
[SCAN], 63000, 52747.1345646438
[SCAN], 64000, 68935.39790575916
[SCAN], 65000, 68842.74453781513
[SCAN], 66000, 66047.56529209622
[SCAN], 67000, 73749.59597806216
[SCAN], 68000, 67696.60363636364
[SCAN], 69000, 56267.73684210526
[SCAN], 70000, 66442.67324955117
[SCAN], 71000, 82559.39130434782
[SCAN], 72000, 93676.6688172043
[SCAN], 73000, 73488.04905660378
[SCAN], 74000, 72704.2276867031
[SCAN], 75000, 70786.94845360825
[SCAN], 76000, 65965.4300168634
[SCAN], 77000, 88828.42247191012
[SCAN], 78000, 66597.5960591133
[SCAN], 79000, 58879.30577223089
[SCAN], 80000, 76237.3376146789
[SCAN], 81000, 53419.63274336283
[SCAN], 82000, 97993.35681818181
[SCAN], 83000, 54806.132352941175
[SCAN], 84000, 51516.868146214096
[SCAN], 85000, 57644.448979591834
[SCAN], 86000, 57206.00747384156
[SCAN], 87000, 56300.63736263736
[SCAN], 88000, 50521.44359949303
[SCAN], 89000, 59129.05381165919
[SCAN], 90000, 64394.15397082658
[SCAN], 91000, 51683.34130146082
[SCAN], 92000, 50012.09706257982
[SCAN], 93000, 72476.18634686347
[SCAN], 94000, 69480.40476190476
[SCAN], 95000, 46783.780885780885
[SCAN], 96000, 69025.05438596492
[SCAN], 97000, 78977.03476482618
[SCAN], 98000, 67758.25254237288
[SCAN], 99000, 60577.8390625
[SCAN], 100000, 63803.649122807015
[SCAN], 101000, 52980.48492462312
[SCAN], 102000, 59703.29329173167
[SCAN], 103000, 79972.8926441352
[SCAN], 104000, 103834.60925449872
[SCAN], 105000, 63689.512155591576
[SCAN], 106000, 73625.78711985689
[SCAN], 107000, 53495.57681940701
[SCAN], 108000, 60458.272030651344
[SCAN], 109000, 75184.57430340558
[SCAN], 110000, 58293.36552748886
[SCAN], 111000, 54496.57980900409
[SCAN], 112000, 60102.80061349693
[SCAN], 113000, 47937.38855054811
[SCAN], 114000, 70976.59042553192
[SCAN], 115000, 48026.97048406139
[SCAN], 116000, 46589.270833333336
[SCAN], 117000, 55768.42780748663
[SCAN], 118000, 65821.07978723405
[SCAN], 119000, 93389.22747747747
[SCAN], 120000, 64401.39178515008
[SCAN], 121000, 68056.61728395062
[SCAN], 122000, 66519.92446633826
[SCAN], 123000, 52216.14453125
[SCAN], 124000, 49459.262402088774
[SCAN], 125000, 58443.585959885386
[SCAN], 126000, 59384.60385756676
[SCAN], 127000, 61468.098615916955
[SCAN], 128000, 53948.92822384428
[SCAN], 129000, 58328.80597014925
[SCAN], 130000, 98106.2275
[SCAN], 131000, 73665.60971223022
[SCAN], 132000, 82681.81034482758
[SCAN], 133000, 72966.35791366907
[SCAN], 134000, 55755.656984785615
[SCAN], 135000, 78378.35829959514
[SCAN], 136000, 87872.56599552573
[SCAN], 137000, 62605.496229260934
[SCAN], 138000, 77073.62209302325
[SCAN], 139000, 72632.8128440367
[SCAN], 140000, 85397.66812227074
[SCAN], 141000, 78096.06963249517
[SCAN], 142000, 76205.89552238806
[SCAN], 143000, 49991.219667943806
[SCAN], 144000, 61541.1856
[SCAN], 145000, 56552.425034387896
[SCAN], 146000, 59823.57616892911
[SCAN], 147000, 55278.442877291964
[SCAN], 148000, 85444.85350318471
[SCAN], 149000, 78618.322
[SCAN], 150000, 87059.41850220265
[SCAN], 151000, 110873.47922437673
[SCAN], 152000, 58595.95007342144
[SCAN], 153000, 64869.85264900662
[SCAN], 154000, 62836.39338842975
[SCAN], 155000, 50940.059282371294
[SCAN], 156000, 47667.123076923075
[SCAN], 157000, 26152.905380333952
[SCAN], 158000, 14700.0